In [59]:
# Import the required libraries and dependencies
import pandas as pd
from pathlib import Path

In [61]:
#import csv
path = "Resources/HistoricalData.csv"
df = pd.read_csv(path,parse_dates=True)
df.head()

         Date  Close/Last  Volume    Open    High     Low
0  04/30/2024      1.0656     NaN  1.0665  1.0674  1.0655
1  04/29/2024      1.0703     NaN  1.0719  1.0724  1.0703
2  04/28/2024      1.0716     NaN  1.0692  1.0720  1.0692
3  04/26/2024      1.0694     NaN  1.0729  1.0753  1.0674
4  04/25/2024      1.0722     NaN  1.0729  1.0732  1.0718

In [63]:
#extract columns
df2 = df[['Date','Close/Last']].copy()

In [65]:
#EXTRACT COLUMNS
df2.rename(columns={'Close/Last':'Close'})
df2.set_index('Date')

            Close/Last
Date
04/30/2024      1.0656
04/29/2024      1.0703
04/28/2024      1.0716
04/26/2024      1.0694
04/25/2024      1.0722
...                ...
05/08/2019      1.1187
05/07/2019      1.1200
05/06/2019      1.1205
05/05/2019      1.1189
05/03/2019      1.1202

[1525 rows x 1 columns]

In [67]:
#convert date column from string to date
df2['Date']=pd.to_datetime(df2['Date'])
df2.head()

        Date  Close/Last
0 2024-04-30      1.0656
1 2024-04-29      1.0703
2 2024-04-28      1.0716
3 2024-04-26      1.0694
4 2024-04-25      1.0722

In [69]:
#EXTRACT BY DATE
df3=df2.loc[(df2['Date']>='2022-01-02')]
df3.head()

        Date  Close/Last
0 2024-04-30      1.0656
1 2024-04-29      1.0703
2 2024-04-28      1.0716
3 2024-04-26      1.0694
4 2024-04-25      1.0722

In [73]:
#drop all nulls
df3.dropna()

          Date  Close/Last
0   2024-04-30      1.0656
1   2024-04-29      1.0703
2   2024-04-28      1.0716
3   2024-04-26      1.0694
4   2024-04-25      1.0722
..         ...         ...
711 2022-01-06      1.1303
712 2022-01-05      1.1315
713 2022-01-04      1.1291
714 2022-01-03      1.1301
715 2022-01-02      1.1341

[716 rows x 2 columns]

In [85]:
#Sort Values
df3=df3.sort_values(by='Date')
df3.head()

          Date  Close/Last
715 2022-01-02      1.1341
714 2022-01-03      1.1301
713 2022-01-04      1.1291
712 2022-01-05      1.1315
711 2022-01-06      1.1303

In [89]:
hed_df=df3

In [91]:
%store hed_df

Stored 'hed_df' (DataFrame)